<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>



Сказка Аленький цветочек<br><hr><br>

Часть 1<br><hr><br>
В некиим царстве, в некиим государстве жил-был богатый купец, именитый человек.<br><br>

Много у него было всякого богатства, дорогих товаров заморских, жемчугу, драгоценных камениев,<br>
золотой и серебряной казны; и было у того купца три дочери, все три красавицы писаные,  <br>
а меньшая лучше всех; и любил он дочерей своих больше всего своего богатства, жемчугов, <br>
драгоценных камениев, золотой и серебряной казны — по той причине, что он был вдовец и  <br>
любить ему было некого; любил он старших дочерей, а меньшую дочь любил больше, потому  <br>
что она была собой лучше всех и к нему ласковее. <br><br>

Вот и собирается тот купец по своим торговым делам за море, за тридевять земель, <br> 
в тридевятое царство, в тридесятое государство, и говорит он своим любезным дочерям: <br><br>

Часть 2 <br><hr><br>
— Дочери мои милые, дочери мои хорошие, дочери мои пригожие, еду я по своим купецким <br> 
делам за тридевять земель, в тридевятое царство, тридесятое государство, и мало ли,  <br>
много ли времени проезжу — не ведаю, и наказываю я вам жить без меня честно и смирно,  <br>
и коли вы будете жить без меня честно и смирно, то привезу вам такие гостинцы, каких  <br>
вы сами захотите, и даю я вам сроку думать на три дня, и тогда вы мне скажете, <br>
каких гостинцев вам хочется. <br><br>

Думали они три дня и три ночи и пришли к своему родителю, и стал он их спрашивать, <br>
каких гостинцев желают. Старшая дочь поклонилась отцу в ноги да и говорит ему первая: <br><br>

Часть 3 <br><hr><br>
 — Государь ты мой батюшка родимый! Не вози ты мне золотой и серебряной парчи, <br>
ни мехов черного соболя, ни жемчуга бурмицкого, а привези ты мне золотой венец  <br>
из камениев самоцветных, и чтоб был от них такой свет, как от месяца полного,  <br>
как от солнца красного, и чтоб было от него светло в темную ночь, как среди дня белого. <br><br>

</body>
</html>
