{"1":{"ru":"Вперед","ua":"Bперед","pl":"Do przodu","en":"Forward "},"2":{"ru":"Назад","ua":"Назад ","pl":"Z powrotem","en":"Back"},"4":{"en":"Show all classes","pl":"Pokaż wszystkie klasy ","ua":"Показати всі класи ","ru":"Показать все классы"},"5":{"en":"Show only user classes ","pl":"Pokaż tylko klasy użytkowników ","ua":"Показати тільки класи користувача ","ru":"Показать только классы пользователя "},"6":{"en":"select ","pl":"Wybierać ","ua":"Вибрати ","ru":"Выбрать"},"7":{"en":"Show all interfaces ","pl":"Pokaż wszystkie interfejsy ","ua":"Показати всі інтерфейси ","ru":"Показать все интерфейсы"},"8":{"en":"Show all interfaces ","pl":"Pokaż wszystkie interfejsy ","ua":"Показати всі інтерфейси ","ru":"Показать интерфейсы пользователя"},"9":{"en":"Show all traits ","pl":"Pokaż wszystkie traits ","ua":"Показати всі трейти ","ru":"Показать все трейты"},"10":{"en":"Show custom traits","pl":"Pokaż niestandardowy traits ","ua":"Показати трейти користувача ","ru":"Показать пользовательские трейты"},"12":{"en":"Item not selected ","pl":"Pozycja nie wybrana ","ua":"Елемент не вибраний ","ru":"Елемент не выбран"},"13":{"en":"Brief information on the interface ","pl":"Krótka informacja o interfejsie ","ua":"Коротка інформація щодо інтерфейсу ","ru":"Краткая информация по интерфейсу"},"14":{"en":"Brief information on the trait ","pl":"Krótka informacja o cechach ","ua":"Коротка інформація з трейту ","ru":"Краткая информация по трейту "},"15":{"en":"Brief information about the class ","pl":"Krótka informacja o klasie ","ua":"Коротка інформація про клас ","ru":"Краткая информация по классу "},"16":{"en":"Interface name","pl":"Nazwa interfejsu","ua":"Ім'я інтерфейсу","ru":"Имя интерфейса"},"17":{"en":"Trait name","pl":"Nazwa trait","ua":"Ім'я трейту","ru":"Имя трейта"},"18":{"en":"Class name ","pl":"Nazwa klasy","ua":"Ім'я класу","ru":"Имя класса"},"19":{"en":"Namespace","pl":"Przestrzeń nazw","ua":"Простір імен","ru":"Пространство имён"},"20":{"en":"Short name ","pl":"Krótkie imię","ua":"Коротке ім'я","ru":"Короткое имя"},"21":{"en":"Interface short name","pl":"Skrócona nazwa interfejsu","ua":"Коротке ім'я інтерфейсу","ru":"Короткое имя интерфейса"},"22":{"en":"Short name of the trait ","pl":"Skrócona nazwa traitu","ua":"Коротке ім'я трейту","ru":"Короткое имя трейта"},"23":{"en":"Short class name ","pl":"Krótka nazwa klasy","ua":"Коротке ім'я класу","ru":"Короткое имя класса"},"24":{"en":"Parent class","pl":"Klasa rodzicielska ","ua":"Батьківський клас","ru":"Родительский класс"},"25":{"en":"Interface names","pl":"Nazwy interfejsów","ua":"Імена інтерфейсів","ru":"Имена интерфейсов"},"26":{"en":"Trait names","pl":"Nazwy traitow","ua":"Імена трейтів ","ru":"Имена трейтов"},"27":{"en":"Stored in a file","pl":"Przechowywane w pliku","ua":"Зберігається у файлі ","ru":"Хранится в файле"},"29":{"en":"To main","pl":"Do głównej","ua":"На головну","ru":"На главную"},"30":{"en":"Library PHP ","pl":"Biblioteka PHP","ua":"Бібліотека","ru":"Библиотека PHP"},"31":{"en":"Patterns","pl":"Szablony ","ua":"Шаблони ","ru":"Шаблоны"},"32":{"en":"Add article","pl":"Dodaj artykuł","ua":"Додати статтю","ru":"Добавить статью"},"33":{"en":"Sign In","pl":"Wejść","ua":"Увійти","ru":"Войти"},"34":{"en":"Sign Out ","pl":"Wyjść ","ua":"Вийти","ru":"Выйти"},"35":{"en":"Register","pl":"Rejestr","ua":"Зареєструватись","ru":"Зарегистрироваться"},"36":{"en":"Singleton pattern - or loner. The essence of this pattern or solution is to create an object only once. This is implemented by creating an object not with the new operator, but with the help of a static method, which of course uses new, but inside the class. The method itself, when the object is first created, places a reference to it in the static property of the new object, and when the method that creates the object is called again, it, the method, returns a reference to the previously created object. All other ways to create an object are blocked.","pl":"Wzór singletona - czyli samotnika. Istotą tego wzorca lub rozwiązania jest stworzenie obiektu tylko raz. Realizuje się to poprzez utworzenie obiektu nie z operatorem new, ale za pomocą metody statycznej, która oczywiście używa new, ale wewnątrz klasy. Sama metoda, gdy obiekt jest tworzony po raz pierwszy, umieszcza odwołanie do niego we właściwości statycznej nowego obiektu, a gdy metoda, która tworzy obiekt, jest wywoływana ponownie, zwraca odwołanie do poprzednio utworzonego obiektu . Wszystkie inne sposoby tworzenia obiektu są zablokowane.","ua":"Шаблон Singleton – чи одинак. Суть цього шаблону чи рішення у тому, щоб створити якийсь об'єкт лише один раз. Реалізується це за допомогою створення об'єкта не оператором new, а за допомогою статичного методу, який, звичайно, використовує new, але всередині класу. Сам метод при першому створенні об'єкта поміщає посилання на нього статичну властивість нового об'єкта і при повторному зверненні до методу, що створює об'єкт, він, метод, повертає посилання на створений раніше об'єкт. Усі інші способи створення об'єкта заблоковано.","ru":"Шаблон Singleton – или одиночка. Суть этого шаблона или решения в том, чтобы создать некий объект только один раз. Реализуется это с помощью создания объекта не оператором new, а с помощью статического метода, который конечно использует new, но внутри класса. Сам метод при первом создании объекта помещает ссылку на него в статическое свойство нового объекта и при повторном обращении к методу, создающему объект, он, метод, возвращает ссылку на созданный ранее объект. Все другие способы создания объекта заблокированы."},"37":{"en":"The Service Locator template is a kind of object manager. Let's imagine a situation when a client - an object, needs another object. You can create this object in place by specifying the path to it, or you can ask for this object from the object manager. In the second option, the client does not care at all where the object manager will take this object from. For example, the object manager can create this object at the time of the request, or create it earlier, remembering a reference to it. The object manager can obtain references to already created objects using its own or someone else's methods for adding data. It doesn't matter how the link to the object gets into the database to the manager, it is important that the manager can give the object to the client and the client doesn't care where the object manager takes this object from. Here is such an interesting pattern that some consider a bad pattern.","pl":"Szablon Service Locator jest rodzajem menedżera obiektów. Wyobraźmy sobie sytuację, w której klient – ​​obiekt, potrzebuje innego obiektu. Możesz utworzyć ten obiekt na miejscu, określając ścieżkę do niego lub możesz poprosić o ten obiekt z menedżera obiektów. W drugim wariancie klienta w ogóle nie interesuje skąd zarządca obiektu weźmie ten obiekt. Na przykład menedżer obiektu może utworzyć ten obiekt w momencie żądania lub utworzyć go wcześniej, pamiętając odniesienie do niego. Menedżer obiektów może uzyskiwać referencje do już utworzonych obiektów za pomocą własnych lub cudzych metod dodawania danych. Nie ma znaczenia, w jaki sposób łącze do obiektu trafia do bazy danych do zarządcy, ważne jest, aby zarządca mógł przekazać obiekt klientowi, a klienta nie obchodzi skąd zarządca obiektów bierze ten obiekt. Oto tak interesujący wzór, że niektórzy uważają go za zły.","ua":"Шаблон Service Locator є менеджером об'єктів. Уявімо ситуацію, коли клієнту - об'єкту, потрібен інший об'єкт. Можна створити цей об'єкт на місці, вказавши до нього шлях, а можна попросити об'єкт у менеджера об'єктів. У другому варіанті клієнту зовсім не важливо, звідки менеджер об'єктів візьме цей об'єкт. Наприклад, менеджер об'єктів може створити цей об'єкт у момент запиту, або створити його раніше, запам'ятавши на нього посилання. Менеджер об'єктів може отримувати посилання вже створені об'єкти з допомогою своїх чи чужих методів додавання даних. Яким чином посилання на об'єкт потрапить до бази менеджера не важливо, важливо, що менеджер може віддати клієнту об'єкт і клієнту не важливо, звідки менеджер об'єктів візьме даний об'єкт. Ось такий цікавий шаблон, який дехто вважає поганим шаблоном. ","ru":"Шаблон Service Locator является неким менеджером объектов. Представим ситуацию, когда клиенту – объекту, нужен другой объект. Можно создать этот объект на месте, указав к нему путь, а можно попросить этот объект у менеджера объектов. Во втором варианте клиенту совершенно не важно, откуда менеджер объектов возьмёт этот объект. К примеру менеджер объектов может создать этот объект в момент запроса, или создать его ранее, запомнив на него ссылку. Менеджер объектов может получать ссылки на уже созданные объекты с помощью своих или чужих методов добавления данных. Каким способом ссылка на объект попадёт в базу к менеджеру не важно, важно, что менеджер может отдать клиенту объект и клиенту не важно, откуда менеджер объектов возьмёт данный объект. Вот такой интересный шаблон, который некоторые считают плохим шаблоном."},"38":{"en":"This template defines how dependencies are passed to an object. If we return to normal language, then dependence is a different object. That is, if we say that we are passing a dependency to some object, this means that we are passing a reference to another object to it. Since after that, the first object becomes dependent on the second, then the dependency transfer occurs. Programmers love to complicate simple things. Well, this template just means that another object will be transferred to a certain object. Dependency is better viewed at the class level, when one class uses the resources of another, then it depends on it. ","pl":"Ten szablon definiuje sposób przekazywania zależności do obiektu. Jeśli wrócimy do normalnego języka, to zależność jest innym przedmiotem. Oznacza to, że jeśli mówimy, że przekazujemy zależność do jakiegoś obiektu, oznacza to, że przekazujemy mu odwołanie do innego obiektu. Ponieważ potem pierwszy obiekt staje się zależny od drugiego, następuje przeniesienie zależności. Programiści uwielbiają komplikować proste rzeczy. Cóż, ten szablon oznacza po prostu, że inny obiekt zostanie przeniesiony do określonego obiektu. Zależność jest lepiej postrzegana na poziomie klasy, kiedy jedna klasa korzysta z zasobów innej, to jest od niej zależna.","ua":"Цей шаблон визначає спосіб передачі об'єкту залежностей. Якщо повернутися до нормальної мови, залежність – це інший об'єкт. Тобто, говоримо, що якомусь об'єкту передаємо залежність – це означає, що передаємо йому посилання на інший об'єкт. Оскільки після цього, перший об'єкт стає залежним від другого, і відбувається передача залежності. Програмісти люблять ускладнювати прості речі. Ну а цей шаблон таки означає, що в якийсь об'єкт буде переданий інший об'єкт. Залежність краще проглядається лише на рівні класів, коли один клас використовує ресурси іншого, він від нього залежить.","ru":"Данный шаблон определяет способ передачи объекту зависимостей. Если вернуться к нормальному языку, то зависимость – это другой объект. То есть, если говорим, что некоему объекту передаем зависимость – это означает, что передаем ему ссылку на другой объект. Так как после этого, первый объект становится зависимым от второго, то и происходит передача зависимости. Программисты любят усложнять простые вещи. Ну а данный шаблон как раз и означает, что в некий объект будет передан другой объект. Зависимость лучше просматривается на уровне классов, когда один класс использует ресурсы другого, то он от него зависит."},"39":{"en":"A very interesting solution. It is used when an object can or should consist of other, simple objects. For example, the navigation menu of this site is based on the Composite template. Simple buttons, such as the Home button, are simple objects. The dropdown menu, which is the Patterns menu, is a complex object that consists of simple objects such as the Home button. Simple objects - buttons and compound objects - drop-down menus, have a common interface. To use the system of these objects, a third class is used - a container that accepts these objects and launches their main method, which solves a specific task.","pl":"Bardzo ciekawe rozwiązanie. Jest używany, gdy obiekt może lub powinien składać się z innych, prostych obiektów. Na przykład menu nawigacyjne tej witryny jest oparte na szablonie Composite. Proste przyciski, takie jak przycisk Początek, są prostymi obiektami. Menu rozwijane, czyli menu Wzory, jest złożonym obiektem, który składa się z prostych obiektów, takich jak przycisk Początek. Obiekty proste – przyciski i obiekty złożone – menu rozwijane, mają wspólny interfejs. Do korzystania z systemu tych obiektów wykorzystywana jest trzecia klasa – kontener, który przyjmuje te obiekty i uruchamia ich główną metodę, która rozwiązuje określone zadanie.","ua":"Дуже цікаве рішення. Застосовується тоді, коли об'єкт може або повинен складатися з інших, простих об'єктів. Наприклад, навігаційне меню цього сайту створено за шаблоном Composite. Прості кнопки, наприклад кнопка Home – це простий об'єкт. Меню, що випадає, яким є меню Patterns - це складний об'єкт, який складається, з простих об'єктів, таких як кнопка Home. Прості об'єкти - кнопки і складові об'єкти - меню, що випадають, мають спільний інтерфейс. Для використання системи цих об'єктів використовується третій клас - контейнер, який приймає себе ці об'єкти і запускає їх головний метод, який вирішує певне завдання.","ru":"Очень интересное решение. Применяется тогда, когда некий объект может или должен состоять из других, простых объектов. На пример навигационное меню этого сайта создано по шаблону Composite. Простые кнопки, на пример кнопка Home – это простой объект. Выпадающее меню, коим является меню Patterns – это сложный объект, который состоит, из простых объектов, таких как кнопка Home. Простые объекты – кнопки и составные объекты - выпадающие меню, имеют общий интерфейс. Для использования системы этих объектов используется третий класс - контейнер, который принимает к себе эти объекты и запускает их главный метод, решающий определенную задачу. "},"40":{"en":"To summarize, the Composite template is an output object that can take simple or complex objects and run some of their methods, which is specified in the interfaces. The description is simplified, more information with an example in the video.","pl":"Podsumowując, szablon Composite jest obiektem wyjściowym, który może pobierać proste lub złożone obiekty i uruchamiać niektóre z ich metod, które są określone w interfejsach. Opis jest uproszczony, więcej informacji wraz z przykładem w filmie.","ua":"Підводячи підсумок, шаблон Composite - це на виході об'єкт, який може приймати в себе прості або складні об'єкти і запускати їх метод, який заданий в інтерфейсах. Опис спрощений, детальніше з прикладом інформація в ролику.","ru":"Подводя итог, шаблон Composite – это на выходе объект, который может принимать в себя простые или сложные объекты и запускать некий их метод, который задан в интерфейсах. Описание упрощенное, подробнее с примером информация в ролике."},"41":{"en":"Games","pl":"Gry","ua":"Ігри","ru":"Игры"},"42":{"en":"Survive","pl":"Przetrwać","ua":"Вижити","ru":"Выжить"},"43":{"en":"Number of connected classes","pl":"Liczba połączonych klas","ua":"Число підключених класів","ru":"Число подключенных классов"},"44":{"en":"Go to Youtube channel","pl":"Przejdź do kanału Youtube","ua":"Перейти на канал Youtube","ru":"Перейти на Youtube канал"},"45":{"en":"Go to GitHub","pl":"Przejdź do GitHuba","ua":"Перейти на GitHub","ru":"Перейти на GitHub"},"46":{"en":"Used technologies","pl":"Stosowane technologie","ua":"Використані технології","ru":"Использованные технологии"},"47":{"en":"Applied Templates","pl":"Stosowane szablony","ua":"Застосовані шаблони","ru":"Применённые шаблоны"},"48":{"en":"Rules for using the NavBar menu","pl":"Zasady korzystania z menu NavBar","ua":"Правила використання меню NavBar","ru":"Правила использования меню NavBar"},"49":{"en":"In the article I will show how you can use the menu from Bootstrap 5.x in a PHP program. The first thing to do is to get this project. You can download or look at it on github, link to github at the bottom of the page.","pl":"W artykule pokażę jak można wykorzystać menu z Bootstrap 5.x w programie PHP. Pierwszą rzeczą do zrobienia jest zdobycie tego projektu. Możesz go pobrać lub obejrzeć na githubie, link do githuba na dole strony.","ua":"У статті покажу як можна використовувати меню від Bootstrap 5.x у програмі PHP. Перше, що слід зробити – це отримати цей проект. Завантажити чи подивитися на нього можна на гітхабі, посилання на гітхаб унизу сторінки.","ru":"В статье покажу как можно использовать меню от Bootstrap 5.x в PHP программе. Первое, что следует сделать – это получить данный проект. Скачать или посмотреть на него можно на гитхабе, ссылка на гитхаб внизу страницы."},"50":{"en":"After downloading or copying the project, you need to attach it to your site. This can be done in many ways. The project is namespaced according to the PSR standard, so if you have an autoloader according to this standard, all that remains is to mark up the project in the correct folder. If you do not have an autoloader, then you can include all the files separately with the include or requery commands. There is also an easier option - this is to throw all the classes into one file and include it. That is, you can connect the project in any convenient way.","pl":"Po pobraniu lub skopiowaniu projektu musisz dołączyć go do swojej witryny. Można to zrobić na wiele sposobów. Projekt ma przestrzenie nazw zgodnie ze standardem PSR, więc jeśli masz autoloader zgodny z tym standardem, pozostaje tylko zaznaczyć projekt w odpowiednim folderze. Jeśli nie masz modułu automatycznego ładowania, możesz dołączyć wszystkie pliki oddzielnie za pomocą poleceń include lub requery. Jest też łatwiejsza opcja - polega na wrzuceniu wszystkich klas do jednego pliku i dołączeniu go. Oznacza to, że możesz podłączyć projekt w dowolny dogodny sposób.","ua":"Після завантаження чи копіювання проект потрібно приєднати до свого сайту. Це можна зробити у різний спосіб. Проект розміщується у просторі імен відповідно до стандарту PSR, тому, якщо у Вас є автозавантажувач за цим стандартом, залишиться лише розмітити проект у правильну папку. Якщо у Вас немає автозавантажувача, можна всі файли підключити окремо командами include або requery. Ще простіше варіант – це скинути всі класи в один файл і підключити його. Тобто підключити проект можна будь-яким зручним способом.","ru":"После скачивания или копирования проект нужно присоединить к своему сайту. Это можно сделать разными способами. Проект располагается в пространстве имён согласно стандарту PSR, поэтому, если у Вас есть автозагрузчик по этому стандарту, останется только разметить проект в правильную папку. Если у Вас нет автозагрузчика, то можно все файлы подключить отдельно командами include или requery. Ещё есть проще вариант – это скинуть все классы в один файл и подключить его. То есть подключить проект можно любым удобным способом."},"51":{"en":"So, the project is connected, it remains to figure out how to use it. Remember that an example was taken from the Bootstrap 5 site for work. The markup that was taken as a sample is located at the end of the NavMenu.php file. There, only at the beginning of the file is a brief instruction for use. This information is important because this markup is hardwired into the class by default.","pl":"Tak więc projekt jest połączony, pozostaje wymyślić, jak go użyć. Pamiętaj, że przykład do pracy został zaczerpnięty ze strony Bootstrap 5. Znaczniki, które zostały pobrane jako próbka, znajdują się na końcu pliku NavMenu.php.Tam tylko na początku pliku znajduje się krótka instrukcja użytkowania. Te informacje są ważne, ponieważ te znaczniki są domyślnie wbudowane w klasę.","ua":"Отже, проект підключений, залишається розібратися, як його використовувати. Пам'ятаємо, що для роботи взято приклад із сайту Bootstrap 5. Розмітка, яка взята за зразок знаходиться наприкінці файлу NavMenu.php. Інформація про це важлива, оскільки ця розмітка зашита у клас за замовчуванням.","ru":"Итак, проект подключен, остается разобраться как его использовать. Помним, что для работы взят пример из сайта Bootstrap 5. Разметка, которая взята за образец находится в конце файла NavMenu.php.Там же, только в начале файла располагается краткая инструкция к использованию. Информация об этом важна, так как эта разметка зашита в класс по умолчанию."},"52":{"en":"One question was sorted out. Next, you should pay attention to the NavBarFacade class - this is the Facade template, that is, a separate class that simplifies working with this system or any other complex system. This class is used on this site, but it remained in the main library folder solely for the sake of an example, and we will consider the system based on it. With the organization that is in the current Facade, in order for the menu to work, you just need to create an object in the desired file. In the case of the PSR autoloader, it looks like this:","pl":"Jedno pytanie zostało wyjaśnione. Następnie należy zwrócić uwagę na klasę NavBarFacade - jest to szablon Fasada, czyli osobna klasa ułatwiająca pracę z tym systemem lub dowolnym innym złożonym systemem. Ta klasa jest używana na tej stronie, ale pozostała w głównym folderze biblioteki wyłącznie ze względu na przykład i rozważymy oparty na niej system. Przy organizacji jaka jest w aktualnej Fasadzie, aby menu działało wystarczy utworzyć obiekt w żądanym pliku. W przypadku autoloadera PSR wygląda to tak:","ua":"Одне питання розібрали. Далі слід звернути увагу на class NavBarFacade – це шаблон Facade, тобто окремий клас, що спрощує роботу з цією системою чи будь-якою іншою складною системою. Цей клас використовується на цьому сайті, але в папці основної бібліотеки він залишився виключно заради прикладу, по ньому розглядатимемо систему. При тій організації, що є в Фасаді, для того, щоб меню запрацювало необхідно просто створити об'єкт у потрібному файлі. У випадку з автозавантажувачем PSR це виглядає так:","ru":"Один вопрос разобрали. Дальше следует обратить внимание на class NavBarFacade – это шаблон Facade, то есть отдельный класс, упрощающий работу с данной системой или любой другой сложной системой. Этот класс используется на этом сайте, но в папке основной библиотеки он остался исключительно ради примера, по нему и будем рассматривать систему. При той организации, что есть в текущем Фасаде, для того, чтобы меню заработало необходимо просто создать объект в нужном файле. В случае с автозагрузчиком по PSR это выглядит так:"},"53":{"en":"Next, we pass to the static method <b>NavBarFacade::createNavBar()<\/b>. Depending on the time and further modifications, the code may differ. With the help of the Facade, a translator is built into the navigation menu, which will be built in there yet, at the time of reading the article, I don’t know, maybe nothing, maybe a lot, so we consider the navigation menu by commands, and not by line numbers or order. This concludes the lyrical digression and turn to the specifics.","pl":"Następnie przechodzimy do metody statycznej <b>NavBarFacade::createNavBar()<\/b>. W zależności od czasu i dalszych modyfikacji kod może się różnić. Za pomocą Fasady w menu nawigacyjnym wbudowany jest tłumacz, który będzie tam wbudowany jeszcze, w momencie czytania artykułu, nie wiem, może nic, może dużo, więc rozważamy nawigację menu za pomocą poleceń, a nie według numerów linii lub kolejności. Na tym kończymy liryczną dygresję i przechodzimy do konkretów.","ua":"Далі переходимо у статичний метод <b>NavBarFacade::createNavBar()<\/b>. Залежно від часу та подальших модифікацій код може відрізнятися. За допомогою Фасаду в навігаційне меню вбудований перекладач, що буде вбудовано туди ще, на момент прочитання статті, не знаю, може нічого, а може і багато, тому розглядаємо навігаційне меню за командами, а не за номерами рядків чи порядків. На цьому закінчую ліричний відступ та переходжу до конкретики.","ru":"Далее переходим в статический метод <b>NavBarFacade::createNavBar()<\/b>. В зависимости от времени и дальнейших модификаций, код может отличаться. С помощью Фасада в навигационное меню встроен переводчик, что будет встроено туда ещё, на момент прочтения статьи, не знаю, может ничего, а может и многое, поэтому рассматриваем навигационное меню по командам, а не по номерам строк или порядку. На этом заканчиваю лирическое отступление и перехожу к конкретике."},"54":{"en":"The menu is based on the Composite pattern - this means that there will be simple objects and complex objects consisting of simple objects. There will also be a main class that renders the menu and also serves as a property container. The last thought is very important to remember.","pl":"Menu oparte jest na wzorcu Composite - oznacza to, że pojawią się obiekty proste oraz obiekty złożone składające się z obiektów prostych. Będzie też główna klasa, która renderuje menu, a także służy jako kontener właściwości. Ostatnia myśl jest bardzo ważna do zapamiętania.","ua":"Меню створено за шаблоном Composite – це означає, що будуть прості та складні об'єкти, що складаються з простих об'єктів. Також буде головний клас, який виводить меню і служить контейнером властивостей. Останню думку запам'ятати дуже важливо.","ru":"Меню создано по шаблону Composite – это означает, что будут простые объекты и сложные объекты, состоящие из простых объектов. Также будет главный класс, который выводит меню и также служит контейнером свойств. Последнюю мысль запомнить очень важно. "},"55":{"en":"The entire NavBar menu consists of HTML markup and style classes from Bootstrap. We will practically not change the markup, although I have added some additional features to the project. However, with the help of style classes, you can change the properties of the navigation menu. And now attention!! All style classes are hardwired into the main class, and if they need to be changed, then the properties are changed using a special method in the main class. Therefore, the main class should be created at the beginning.","pl":"Całe menu NavBar składa się ze znaczników HTML i klas stylów z Bootstrap. Praktycznie nie zmienimy znaczników, chociaż do projektu dodałem kilka dodatkowych funkcji. Jednak za pomocą klas stylów można zmienić właściwości menu nawigacyjnego. A teraz uwaga!! Wszystkie klasy stylów są wbudowane w klasę główną, a jeśli trzeba je zmienić, wówczas właściwości są zmieniane przy użyciu specjalnej metody w klasie głównej. Dlatego klasę główną należy utworzyć na początku.","ua":"Все меню NavBar складається з HTML розмітки та стильових класів від Bootstrap. Розмітку міняти практично не будемо, хоча я вніс деякі додаткові можливості у проект. Однак, за допомогою стильових класів можна змінювати властивості навігаційного меню. А тепер увага!! Всі стильові класи зашиті саме у головний клас, і якщо їх потрібно поміняти, то зміна властивостей проводиться за допомогою спеціального методу у головному класі. Тому головний клас слід створювати на початку.","ru":"Всё меню NavBar состоит из HTML разметки и стилевых классов от Bootstrap. Разметку менять практически не будем, хотя я внес некоторые дополнительные возможности в проект. Однако с помощью стилевых классов можно менять свойства навигационного меню. А теперь внимание!! Все стилевые классы зашиты именно в главный класс, и если их нужно поменять, то изменение свойств производится с помощью специального метода в главном классе. Поэтому главный класс следует создавать в начале."},"56":{"en":"After the main object has been created, you can start using its resources. Consider a method that allows you to change the menu properties. For example, we want to change the color scheme of the navigation menu. By default, the color scheme is set by the following classes:","pl":"Po utworzeniu obiektu głównego można przystąpić do korzystania z jego zasobów. Rozważ metodę, która pozwala zmienić właściwości menu. Na przykład chcemy zmienić schemat kolorów menu nawigacyjnego. Domyślnie schemat kolorów jest ustawiany przez następujące klasy:","ua":"Після створення головного об'єкта можна починати користуватися його ресурсами. Розглянемо метод, який дозволяє змінювати властивості меню. Наприклад, хочемо змінити колірну схему навігаційного меню. За замовчуванням колірна схема задана такими класами:","ru":"После того, как был создан главный объект, можно начинать пользоваться его ресурсами. Рассмотрим метод, который позволяет изменять свойства меню. Например хотим изменить цветовую схему навигационного меню. По умолчанию цветовая схема задана такими классами: "},"57":{"en":"To change the color scheme to black, you should replace the corresponding classes with:","pl":"Aby zmienić schemat kolorów na czarny, należy zamienić odpowiednie klasy na:","ua":"Щоб змінити колірну схему на чорну, слід замінити відповідні класи на:","ru":"Чтобы изменить цветовую схему на чёрную, следует заменить соответствующие классы на:"},"58":{"en":"To do this, you need to call the method of the main object <br><b>$obj->setProperty(\"default class\",\"new class\");<\/b><br>If you need to change the same property several times , then the first parameter is always the default value, and the second parameter is the name of the new class. Considering everything written above, you should apply this method twice.","pl":"Aby to zrobić, musisz wywołać metodę głównego obiektu <br><b>$obj->setProperty(\"default class\",\"new class\");<\/b><br>Jeśli potrzebujesz zmienić tej samej właściwości kilka razy, to pierwszy parametr jest zawsze wartością domyślną, a drugi parametr jest nazwą nowej klasy. Biorąc pod uwagę wszystko, co napisano powyżej, powinieneś zastosować tę metodę dwukrotnie.","ua":"Щоб це зробити необхідно викликати метод головного об'єкта <br><b>$obj->setProperty(\"клас за замовчуванням\",\"новий клас\");<\/b><br>Якщо потрібно міняти кілька разів одну і ту ж властивість , то першим параметром задається завжди значення за промовчанням, а другим параметром йде назва нового класу. Враховуючи все вище написане, слід застосувати двічі даний метод. ","ru":"Чтобы - это сделать необходимо вызвать метод главного объекта <br><b>$obj->setProperty(\"класс по умолчанию\",\"новый класс\");<\/b><br>Если нужно менять несколько раз одно и то же свойство, то первым параметром задается всегда значение по умолчанию, а вторым параметром идёт название нового класса. Учитывая, всё выше написанное, следует, применить два раза данный метод."},"59":{"en":"This way you can replace all CSS classes in the navigation menu. When all the settings are over, you can proceed to the next step. By the way, these settings can not be used, then the navigation bar will be formed as it is in the example on the Bootstrap page.","pl":"W ten sposób możesz zastąpić wszystkie klasy CSS w menu nawigacyjnym. Po zakończeniu wszystkich ustawień możesz przejść do następnego kroku. Nawiasem mówiąc, tych ustawień nie można użyć, wtedy pasek nawigacyjny zostanie utworzony tak, jak w przykładzie na stronie Bootstrap.","ua":"У такий спосіб можна замінити всі CSS класи в навігаційному меню. Коли всі налаштування закінчаться, можна перейти до наступного кроку. До речі, дані налаштування можна і не використовувати, тоді навігаційна панель сформується такою, як вона є в прикладі, на сторінці Bootstrap.","ru":"Таким образом можно заменить все CSS классы в навигационном меню. Когда все настройки закончатся, можно переходить к следующему шагу. Кстати данные настройки можно и не использовать, тогда навигационная панель сформируется такой, как она есть в примере, на странице Bootstrap. "},"60":{"en":"There are several special properties that control the display of the navigation menu. The <strong>Navbar<\/strong> property determines what will be displayed in the navigation menu heading, on the left side.<br> Property <strong>button-search<\/strong> determines whether the search menu will be displayed. Unfortunately, at the moment, this button and input field can only be used in the form in which they are in the example. Style classes can be changed as usual, and functionality needs to be done using JS, but it is quite possible that I will not forget to fix this flaw in future mods.<br> The next special property determines the value that will be sent as a GET parameter to the address bar. The <strong>link<\/strong> property is set in the same way as the previous properties. It must be set before creating each button object.","pl":"Istnieje kilka specjalnych właściwości, które sterują wyświetlaniem menu nawigacyjnego. Właściwość <strong>Navbar<\/strong> określa, co będzie wyświetlane w nagłówku menu nawigacyjnego po lewej stronie.<br> Właściwość <strong>button-search<\/strong> określa, czy zostanie wyświetlone menu wyszukiwania. Niestety w tej chwili tego przycisku i pola wprowadzania można używać tylko w takiej formie, w jakiej występują w przykładzie. Klasy stylów można zmieniać jak zwykle, a funkcjonalność musi być wykonywana przy użyciu JS, ale jest całkiem możliwe, że nie zapomnę naprawić tego błędu w przyszłych modach.<br> Następna właściwość specjalna określa wartość, która zostanie wysłana jako parametr GET do paska adresu. Właściwość <strong>link<\/strong> jest ustawiana w taki sam sposób jak poprzednie właściwości. Należy go ustawić przed utworzeniem każdego obiektu przycisku.","ua":"Є кілька спеціальних властивостей, що керують виведенням навігаційного меню. Властивість <strong>Navbar<\/strong> визначає, що буде виведено в заголовку навігаційного меню, з лівого боку.<br> Властивість <strong>button-search<\/strong> визначає, чи відображатиметься меню пошуку. На жаль, на даний момент, ця кнопка та поле для введення можуть використовуватися лише у тому вигляді, в якому вони є у прикладі. Стилеві класи можна змінювати, як звичайно, а функціонал потрібно робити засобами JS, але цілком можливо, що в наступних модах я не забуду цей недолік виправити. Властивість <strong>link<\/strong> задається так само, як і попередні властивості. Задавати його необхідно перед створенням кожного об'єкта – кнопки.","ru":"Есть несколько специальных свойств, которые управляют выводом навигационного меню. Свойство <strong>Navbar<\/strong> определяет, что будет выведено в заголовке навигационного меню, с левой стороны.<br> Свойство <strong>button-search<\/strong> определяет, будет ли выводиться меню поиска. К сожалению, на данный момент, данная кнопка и поле для ввода могут использоваться только в том виде, в котором они есть в примере. Стилевые классы можно изменять, как обычно, а функционал нужно делать средствами JS, но вполне возможно, что в следующих модах я не забуду этот недостаток исправить.<br> Следующее специальное свойство определяет значение, которое будет отправлено в качестве GET параметра в адресную строку. Свойство <strong>link<\/strong> задаётся таким же самым образом, как и предыдущие свойства. Задавать его необходимо перед созданием каждого объекта - кнопки."},"61":{"en":"A bit of theory. The navigation menu manages the content on the page by <strong>throwing<\/strong> into the address bar various elements of the GET array. By setting the desired values for the buttons - objects of the <strong>link<\/strong> parameter, this parameter can be controlled.<br> Well, then insert a check and <strong>voila<\/strong> into the code.","pl":"Trochę teorii. Menu nawigacyjne zarządza zawartością strony poprzez <strong>wrzucanie<\/strong> do paska adresu różnych elementów tablicy GET. Ustawiając żądane wartości dla przycisków - obiektów parametru <strong>link<\/strong>, można sterować tym parametrem.<br> No to wstaw czek i <strong>voila<\/strong> do kod.","ua":"Трохи теорії. Навігаційне меню керує контентом на сторінці <strong>викидаючи<\/strong> в адресний рядок різні елементи GET масиву. Задаючи необхідні значення для кнопок - об'єктів параметра <strong>link<\/strong>, цим параметром можна управляти.<br> Ну а далі в код вставляєте перевірку і <strong>вуаля<\/strong>.","ru":"Немного теории. Навигационное меню управляет контентом на странице <strong>выкидывая<\/strong> в адресную строку различные элементы GET массива. Задавая нужные значения для кнопок - объектов параметра <strong>link<\/strong>, этим параметром можно управлять.<br> Ну а далее в код вставляете проверку и <strong>вуаля<\/strong>."},"62":{"en":"-create first button","pl":"-utwórz pierwszy przycisk","ua":"-створити першу кнопку","ru":"-создать первую кнопку"},"63":{"en":"Another mandatory parameter is the caption on the button, it is set by setting the <strong>Home<\/strong> property.","pl":"Kolejnym obowiązkowym parametrem jest podpis na przycisku, ustawia się go poprzez ustawienie właściwości <strong>Home<\/strong>.","ua":"Ще одним обов'язковим параметром є напис на кнопці, він задається встановленням властивості <strong>Home<\/strong>.","ru":"Ещё одним обязательным параметром является надпись на кнопке, она задаётся установкой свойства <strong>Home<\/strong>."},"64":{"en":"Now, assuming that the general style properties are set somewhere above, we prepare the two required properties to create the button. The button should say \"Go\" and the address bar should have an array element $_GET[\"goPageOne\"].","pl":"Teraz, zakładając, że ogólne właściwości stylu są ustawione gdzieś powyżej, przygotowujemy dwie wymagane właściwości do utworzenia przycisku. Przycisk powinien mieć napis „Go”, a pasek adresu powinien zawierać element tablicy $_GET[\"goPageOne\"].","ua":"Тепер, припускаючи, що загальні стильові властивості задані десь вище, готуємо дві обов'язкові властивості для створення кнопки. На кнопці має бути написано \"Перейти\", а в адресному рядку має з'явитися елемент масиву $_GET[\"goPageOne\"].","ru":"Теперь, допуская, что общие стилевые свойства заданы где-то выше, подготавливаем два обязательных свойства для создания кнопки. На кнопке должно быть написано \"Перейти\", а в адресной строке должен появиться элемент массива $_GET[\"goPageOne\"]."},"65":{"en":"Go","pl":"Iść","ua":"Перейти","ru":"Перейти"},"66":{"en":"Thus, we directly approached the creation of a button object, which will then be placed in a container and displayed on the page already as part of the whole navigation menu.","pl":"Tym samym podeszliśmy bezpośrednio do stworzenia obiektu przycisku, który następnie zostanie umieszczony w kontenerze i wyświetlony na stronie już jako część całego menu nawigacyjnego.","ua":"Таким чином, безпосередньо підійшли до створення об'єкта кнопки, який далі буде поміщений у контейнер і виведений на сторінку вже як частину цілого навігаційного меню.","ru":"Таким образом непосредственно подошли к созданию объекта кнопки, который дальше будет помещен в контейнер и выведен на страницу уже как часть целого навигационного меню."},"67":{"en":"-create a simple button","pl":"-utwórz prosty przycisk","ua":"-створити просту кнопку","ru":"-создать простую кнопку"},"68":{"en":"-create dropdown menu","pl":"-utwórz menu rozwijane","ua":"-створити меню, що випадає","ru":"-создать выпадающее меню"},"69":{"en":"- menu setting","pl":"- ustawienie menu","ua":"-установка меню","ru":"-установка меню"},"70":{"en":"Creating a simple button","pl":"Tworzenie prostego przycisku","ua":"Створення простої кнопки.","ru":"Создание простой кнопки."},"71":{"en":"The NavBar menu consists of single simple buttons and drop-down menus. In this tutorial, we will create a simple button. All buttons, both simple and complex, are objects, so let's create an object for a simple button. Actually, such an object was created in the previous review, but there was a lot of other information.","pl":"Menu NavBar składa się z pojedynczych prostych przycisków i menu rozwijanych. W tym samouczku utworzymy prosty przycisk. Wszystkie przyciski, zarówno proste, jak i złożone, są obiektami, więc utwórzmy obiekt dla prostego przycisku. Właściwie taki obiekt powstał w poprzedniej recenzji, ale było dużo innych informacji.","ua":"Меню NavBar складається з одинарних простих кнопок і меню. У цьому огляді створимо просту кнопку. Всі кнопки, як прості, так і складні, є об'єктами, тому створимо об'єкт для простої кнопки. Власне, такий об'єкт був створений у попередньому огляді, але там було багато іншої інформації.","ru":"Меню NavBar состоит из одинарных простых кнопок и выпадающих меню. В этом обзоре создадим простую кнопку. Все кнопки, как простые, так и сложные, являются объектами, поэтому, создадим объект для простой кнопки. Собственно такой объект был создан в предыдущем обзоре, но там было много другой информации."},"72":{"en":"To create a simple button, you need to give it two parameters that are needed for the further operation of the system. It is necessary to set the inscription on the button and the link that will be set in the &lt;a&gt; tag. To set any properties there is a universal method, let's do this:","pl":"Aby stworzyć prosty przycisk, należy nadać mu dwa parametry, które są potrzebne do dalszej pracy systemu. Konieczne jest ustawienie napisu na przycisku oraz linku, który zostanie ustawiony w tagu &lt;a&gt;. Aby ustawić dowolne właściwości, istnieje uniwersalna metoda, zróbmy to:","ua":"Щоб створити просту кнопку, потрібно встановити їй два параметри, які потрібні для подальшої роботи системи. Необхідно задати напис на кнопці та посилання, яке буде встановлено в тег &lt;a&gt;. Для встановлення будь-яких властивостей є універсальний метод, зробимо це:","ru":"Чтобы создать простую кнопку, нужно задать ей два параметра, которые нужны для дальнейшей работы системы. Необходимо задать надпись на кнопке и ссылку, которая будет установлена в тег &lt;a&gt;. Для установки любых свойств есть универсальный метод, сделаем это:"},"73":{"en":"Thus, in the main class, all parameters are created to create a button object. It remains to actually create the button.","pl":"Tak więc w klasie głównej wszystkie parametry są tworzone w celu utworzenia obiektu przycisku. Pozostaje właściwie utworzyć przycisk.","ua":"Таким чином, у головному класі створені всі параметри, для створення об'єкта кнопки. Залишається власне створити кнопку.","ru":"Таким образом в главном классе созданы все параметры, для создания объекта кнопки. Остается собственно создать кнопку."},"74":{"en":"So the last command creates a simple button object. A reference to this object is placed in a variable. That is, everything is as usual. Let's take a closer look. <br> A simple button is created by the <strong>ElementNavBar()<\/strong> class, and the parameters for creating the button are in the main class, which is also a property container. Therefore, when creating a button, the main object should be passed to the class. Until the object was created, methods for changing properties were used from the main class.","pl":"Tak więc ostatnie polecenie tworzy prosty obiekt przycisku. Odwołanie do tego obiektu jest umieszczane w zmiennej. To znaczy, wszystko jest jak zwykle. Przyjrzyjmy się bliżej. <br> Prosty przycisk jest tworzony przez klasę <strong>ElementNavBar()<\/strong>, a parametry do tworzenia przycisku znajdują się w klasie głównej, która jest również kontenerem właściwości. Dlatego podczas tworzenia przycisku główny obiekt powinien zostać przekazany do klasy. Do momentu powstania obiektu stosowano metody zmiany właściwości z klasy głównej.","ua":"Отже, остання команда створює об'єкт простої кнопки. Посилання на цей об'єкт міститься у змінну. Тобто все як завжди. Розглянемо ближче. <br> Проста кнопка створюється класом <strong>ElementNavBar()<\/strong>, а параметри для створення кнопки знаходяться в головному класі, який також є контейнером властивостей. Тому, під час створення кнопки в клас слід передавати головний об'єкт. До моменту створення об'єкта методи зміни властивостей було використано саме з головного класу.","ru":"Итак, последняя команда создает объект простой кнопки. Ссылка на этот объект помещается в переменную. То есть всё как обычно. Рассмотрим ближе. <br> Простая кнопка создается классом <strong>ElementNavBar()<\/strong>, а параметры для создания кнопки находятся в главном классе, который также является и контейнером свойств. Поэтому, при создании кнопки в класс следует передавать главный объект. До момента создания объекта методы изменения свойств были использованы именно из главного класса."},"75":{"en":"Thus, to create a simple button, you need to use three lines of code. Agree, the description took much longer than the actual use of this information. In the next review, we will create a dropdown menu.","pl":"Tak więc, aby stworzyć prosty przycisk, musisz użyć trzech linii kodu. Zgadzam się, opis trwał znacznie dłużej niż faktyczne wykorzystanie tych informacji. W następnej recenzji utworzymy menu rozwijane.","ua":"Таким чином, для створення простої кнопки необхідно використовувати три рядки коду. Погодьтеся, опис зайняв набагато більше часу, ніж фактичне використання цієї інформації. У наступному огляді створимо меню, що випадає.","ru":"Таким образом, для создания простой кнопки необходимо использовать три строчки кода. Согласитесь, описание заняло намного больше времени, чем фактическое использование данной информации. В следующем обзоре создадим выпадающее меню."},"76":{"en":"Creating a drop down menu.","pl":"Tworzenie rozwijanego menu.","ua":"Створення меню, що випадає.","ru":"Создание выпадающего меню."},"77":{"en":"In this review, we will create a dropdown menu. Recalls that the system is built on the principle of the Composite design pattern. This means that complex objects are partially or completely a container for storing simple and complex objects. Of course, the container not only stores, but also uses the resources of those objects that are stored in it.","pl":"W tej recenzji utworzymy menu rozwijane. Przypomina, że ​​system zbudowany jest na zasadzie wzorca projektowego Composite. Oznacza to, że złożone obiekty są częściowo lub całkowicie pojemnikiem do przechowywania prostych i złożonych obiektów. Oczywiście kontener nie tylko przechowuje, ale także korzysta z zasobów tych obiektów, które są w nim przechowywane.","ua":"У цьому огляді створимо меню, що випадає. Згадує, що система побудована за принципом шаблону проектування Композит. Це означає, що складні об'єкти – це частково або повністю контейнер для зберігання простих та складних об'єктів. Зрозуміло, контейнер не просто зберігає, але й використовує ресурси тих об'єктів, які в ньому зберігаються.","ru":"В этом обзоре создадим выпадающее меню. Вспоминает то, что система построена по принципу шаблона проектирования Композит. Это значит, что сложные объекты – это частично или полностью контейнер для хранения простых и сложных объектов. Разумеется контейнер не просто хранит, но и использует ресурсы тех объектов, которые в нем хранятся."},"78":{"en":"So, figured out, a drop-down menu is an object - a container that stores and uses the resources of simple objects. We approach the fact that the drop-down menu will consist of simple buttons that need to be placed in a certain container object.","pl":"Tak więc, wymyślono, rozwijane menu jest obiektem - kontenerem, który przechowuje i wykorzystuje zasoby prostych obiektów. Podchodzimy do tego, że menu rozwijane będzie składało się z prostych przycisków, które należy umieścić w określonym obiekcie kontenera.","ua":"Отже, розібралися, що випадає меню – це об'єкт – контейнер, який зберігає та використовує ресурси простих об'єктів. Підходимо до того, що меню, що випадає, складатиметься з простих кнопок, які потрібно помістити в якийсь об'єкт-контейнер.","ru":"Итак, разобрались, выпадающее меню – это объект – контейнер, который хранит и использует ресурсы простых объектов. Подходим к тому, что выпадающее меню будет состоять из простых кнопок, которые нужно поместить в некий объект-контейнер."},"79":{"en":"We go in order and create simple objects, and we created simple objects in the previous review. However, there is a small nuance. The buttons are independent, in the NavBar menu they are different from the buttons that are included in the drop-down menu. Therefore, when creating simple button-objects, you should specify a special attribute. This feature will allow the ElementNavBar() class to recognize a button specifically for the dropdown menu. In practice, this is done as simply as the button itself: before creating the button object, you need to set one more property. The property is called <strong>work-box<\/strong> and is set using the same generic <strong>setProperty()<\/strong> method.","pl":"Idziemy w kolejności i tworzymy proste obiekty, a proste obiekty tworzyliśmy w poprzedniej recenzji. Istnieje jednak mały niuans. Przyciski są niezależne, w menu NavBar różnią się od przycisków znajdujących się w menu rozwijanym. Dlatego podczas tworzenia prostych obiektów przycisków należy określić specjalny atrybut. Ta funkcja pozwoli klasie ElementNavBar() rozpoznać przycisk specjalnie dla menu rozwijanego. W praktyce odbywa się to tak samo, jak sam przycisk: przed utworzeniem obiektu przycisku należy ustawić jeszcze jedną właściwość. Właściwość nazywa się <strong>work-box<\/strong> i jest ustawiana przy użyciu tej samej ogólnej metody <strong>setProperty()<\/strong>.","ua":"Ідемо по порядку та створюємо прості об'єкти, а прості об'єкти ми створювали у попередньому огляді. Однак, є невеликий нюанс. Кнопки самостійні, в меню NavBar відрізняються від кнопок, які входять до меню. Тому при створенні простих кнопок-об'єктів слід зазначити спеціальну ознаку. Ця ознака дозволить класу ElementNavBar() свідомість кнопки спеціально для випадаючого меню. На практиці - це робиться так само просто, як і сама кнопка: перед створенням об'єкта-кнопки потрібно встановити ще одну властивість. Властивість називається <strong>work-box<\/strong> і встановлюється тим самим універсальним методом <strong>setProperty()<\/strong>.","ru":"Идём по порядку и создаем простые объекты, а простые объекты мы создавали в предыдущем обзоре. Однако есть небольшой нюанс. Кнопки самостоятельные, в меню NavBar отличаются от кнопок, которые входят в выпадающее меню. Поэтому, при создании простых кнопок-объектов следует указать специальный признак. Данный признак позволит классу ElementNavBar() сознать кнопку специально для выпадающего меню. На практике – это делается также просто, как и сама кнопка: перед созданием объекта-кнопки нужно установить ещё одно свойство. Свойство называется <strong>work-box<\/strong> и устанавливается всё тем же универсальным методом <strong>setProperty()<\/strong>."},"80":{"en":"In this way, you should create as many button objects as you need. Naturally, the number and type of buttons can be changed depending on the need.","pl":"W ten sposób powinieneś utworzyć tyle obiektów przycisków, ile potrzebujesz. Oczywiście ilość i rodzaj przycisków można zmieniać w zależności od potrzeb.","ua":"У такий спосіб слід створити стільки кнопок-об'єктів, скільки потрібно. Природно, число та вид кнопок можна змінювати в залежності від потреби.","ru":"Таким способом следует создать столько кнопок-объектов, сколько необходимо. Естественно, число и вид кнопок можно менять в зависимости от потребности."},"81":{"en":"After all button objects have been created, they should be placed in the complex container object for which they were created. This object is created like this:","pl":"Po utworzeniu wszystkich obiektów przycisków należy je umieścić w złożonym obiekcie kontenera, dla którego zostały utworzone. Ten obiekt jest tworzony w następujący sposób:","ua":"Після того, як всі об'єкти кнопки будуть створені, їх слід помістити у складний об'єкт контейнер, для якого вони створювалися. Створюється цей об'єкт таким чином:","ru":"После того, как все объекты кнопки будут созданы, их следует поместить в сложный объект контейнер, для которого они создавались. Создается данный объект таким образом:"},"82":{"en":"As you can see, the object is created in the usual way using the <strong>BoxNavMenu()<\/strong> class, the main object should also be passed to the constructor.","pl":"Jak widać obiekt tworzony jest w zwykły sposób za pomocą klasy <strong>BoxNavMenu()<\/strong>, obiekt główny również należy przekazać do konstruktora.","ua":"Як бачите об'єкт створюється звичайним способом за допомогою класу <strong>BoxNavMenu()<\/strong>, в конструктор також слід передати головний об'єкт.","ru":"Как видите объект создается обычным способом с помощью класса <strong>BoxNavMenu()<\/strong>, в конструктор так же следует передать главный объект."},"83":{"en":"After creating the container object, you should use its method to load all button objects into it. The load order will determine the order in which the buttons appear in the drop-down menu.","pl":"Po utworzeniu obiektu kontenera należy użyć jego metody do załadowania do niego wszystkich obiektów przycisków. Kolejność ładowania określi kolejność, w jakiej przyciski pojawiają się w rozwijanym menu.","ua":"Після створення об'єкта-контейнера слід скористатися його методом для завантаження в нього всіх об'єктів-кнопок. Порядок завантаження визначить порядок розташування кнопок у меню, що випадає.","ru":"После создания объекта-контейнера следует воспользоваться его методом, для загрузки в него всех объектов-кнопок. Порядок загрузки определит порядок расположения кнопок в выпадающем меню."},"84":{"en":"Similarly, all other buttons in the drop-down menu are loaded. After loading all the buttons into the container, it, the container, is ready to be loaded into the main class. We will deal with this in the next review.","pl":"Podobnie ładowane są wszystkie inne przyciski w menu rozwijanym. Po załadowaniu wszystkich przycisków do kontenera, on, kontener, jest gotowy do załadowania do klasy głównej. Zajmiemy się tym w następnej recenzji.","ua":"Аналогічно завантажуються всі інші кнопки у меню, що випадає. Після завантаження всіх кнопок у контейнер, він, контейнер готовий до завантаження в головний клас. Цим займемося у такому огляді.","ru":"Аналогично загружаются все остальные кнопки в выпадающее меню. После загрузки всех кнопок в контейнер, он, контейнер, готов к загрузке в главный класс. Этим займёмся в следующем обзоре."},"85":{"en":"Installing a menu on a page.","pl":"Instalowanie menu na stronie.","ua":"Настроювання меню на сторінку.","ru":"Установка меню на страницу."},"86":{"en":"In previous reviews, we dealt with setting button properties, with creating simple buttons and drop-down menus inside the NavBar navigation menu. The last step left is to put all the buttons and drop-down menus in one container and display it on the site page. And in this matter, the very first created object will help us, the one that is also a container of properties. While only other classes have been using the resources of the main class, it's time to start the main class as well.","pl":"W poprzednich recenzjach zajmowaliśmy się ustawianiem właściwości przycisków, tworzeniem prostych przycisków i rozwijanych menu w menu nawigacji NavBar. Ostatnim krokiem, jaki pozostał, jest umieszczenie wszystkich przycisków i rozwijanych menu w jednym kontenerze i wyświetlenie ich na stronie serwisu. I w tej kwestii pomoże nam pierwszy stworzony obiekt, który jest jednocześnie kontenerem właściwości. Podczas gdy tylko inne klasy korzystały z zasobów klasy głównej, nadszedł czas, aby również uruchomić klasę główną.","ua":"У попередніх оглядах розібралися з налаштуванням властивостей кнопок, зі створенням простих кнопок і меню, що випадає всередині навігаційного меню NavBar. Залишився останній крок, помістити всі кнопки та меню, що випадають, в один контейнер і вивести його на сторінку сайту. І в цьому питанні нам допоможе перший створений об'єкт, той самий, який є одночасно контейнером властивостей. Поки лише інші класи користувалися ресурсами основного класу, настав час запустити й основний клас.","ru":"В предыдущих обзорах разобрались с настройкой свойств кнопок, с созданием простых кнопок и выпадающих меню внутри навигационного меню NavBar. Остался последний шаг, поместить все кнопки и выпадающие меню в один контейнер и вывести его на страницу сайта. И в этом вопросе нам поможет самый первый созданный объект, тот самый, который является одновременно контейнером свойств. Пока только другие классы пользовались ресурсами основного класса, пришло время запустить и основной класс."},"87":{"en":"So, the main container object is created. This object has its own <strong>addElement()<\/strong> method. This container is different from the container discussed in the previous overview. A container from this class can work both with simple button objects and with containers from which drop-down menus are built. Therefore, at the moment all buttons and dropdown menus should be created, we put all previously created individual buttons and entire containers in this container.","pl":"Tak więc tworzony jest główny obiekt kontenera. Ten obiekt ma własną metodę <strong>addElement()<\/strong>. Ten kontener różni się od kontenera omówionego w poprzednim omówieniu. Kontener z tej klasy może współpracować zarówno z prostymi obiektami przycisków, jak iz kontenerami, z których budowane są menu rozwijane. Dlatego w chwili, gdy powinny być utworzone wszystkie przyciski i rozwijane menu, wszystkie utworzone wcześniej pojedyncze przyciski i całe kontenery umieszczamy w tym kontenerze.","ua":"Отже, головний об'єкт контейнер створено. Цей об'єкт має свій метод <strong>addElement()<\/strong>. Цей контейнер відрізняється від розглянутого у попередньому огляді контейнера. Контейнер з цього класу вміє працювати як з простими кнопками-об'єктами, так і з контейнерами, з яких будуються меню, що випадають. Тому, на даний момент всі кнопки і меню, що випадають, повинні бути створені, ми поміщаємо в цей контейнер всі раніше створені окремі кнопки і цілі контейнери.","ru":"Итак, главный объект контейнер создан. У данного объекта есть свой метод <strong>addElement()<\/strong>. Этот контейнер отличается от рассмотренного в предыдущем обзоре контейнера. Контейнер из этого класса умеет работать как с простыми кнопками-объектами, так и с контейнерами, из которых строятся выпадающие меню. Поэтому, на данный момент все кнопки и выпадающие меню должны быть созданы, мы помещаем в этот контейнер все ранее созданные отдельные кнопки и целые контейнеры."},"88":{"en":"If we recall the previous reviews, then in the first and second reviews two simple buttons were created, and we will add them to the main container. Only the button button fits only the one from the first article. The button from the third article is not suitable, as it was specifically made for a drop-down menu.","pl":"Jeśli przypomnimy sobie poprzednie recenzje, to w pierwszej i drugiej recenzji powstały dwa proste przyciski, które dodamy do głównego kontenera. Tylko guzik pasuje tylko do tego z pierwszego artykułu. Przycisk z trzeciego artykułu nie jest odpowiedni, ponieważ został stworzony specjalnie dla menu rozwijanego.","ua":"Якщо згадати попередні огляди, то в першому і другому оглядах були створені дві прості кнопка, їх і додамо в головний контейнер. Тільки кнопка button підходить лише та, що з першої статті. Кнопка з третьої статті не підходить, оскільки вона була спеціально зроблена для меню, що випадає.","ru":"Если вспомнить предыдущие обзоры, то в первом и во втором обзорах были созданы две простые кнопка, их и добавим в главный контейнер. Только кнопка button подходит только та, что с первой статьи. Кнопка из третьей статьи не подходит, так как она была специально сделана для выпадающего меню."},"89":{"en":"In the same way, a drop-down menu is added to the main container, which, in turn, is also a container, we formed it in the third review.","pl":"W ten sam sposób rozwijane menu jest dodawane do głównego kontenera, który z kolei jest również kontenerem, utworzyliśmy go w trzeciej recenzji.","ua":"Так само в головний контейнер додається випадаюче меню, яке, у свою чергу, також є контейнером, ми його сформували в третьому огляді.","ru":"Таким же самым образом в главный контейнер добавляется выпадающее меню, которое, в свою очередь, также является контейнером, мы его сформировали в третьем обзоре. "},"90":{"en":"As you can see, the dropdown menu is added in the same way as a simple button. You can add them in any order, depending on your project requirements.","pl":"Jak widać, menu rozwijane jest dodawane w taki sam sposób, jak prosty przycisk. Możesz dodawać je w dowolnej kolejności, w zależności od wymagań projektu.","ua":"Як бачите меню, що випадає, додається так само як і проста кнопка. Додавати можна у будь-якому порядку, залежно від вимог щодо проекту.","ru":"Как видите выпадающее меню добавляется также как и простая кнопка. Добавлять можно в любом порядке, в зависимости от требований по проекту. "},"91":{"en":"After all the necessary objects are loaded into the main class, you can put the menu on the page, this is done using the method:","pl":"Po załadowaniu wszystkich niezbędnych obiektów do klasy głównej możesz umieścić menu na stronie, odbywa się to za pomocą metody:","ua":"Після того, як до основного класу будуть завантажені всі необхідні об'єкти, можна поставити меню на сторінку, робиться це за допомогою методу:","ru":"После того, как в основной класс будут загружены все необходимые объекты, можно поставить меню на страницу, делается это с помощью метода:"},"92":{"en":"Well, that's all, there are a lot of descriptions, but in fact everything happens very quickly and, most importantly, it is easy to manipulate this menu. By creating dynamically different objects or containers of objects, it is easy to change the appearance of the menu and its functionality.","pl":"Cóż, to wszystko, jest dużo opisów, ale tak naprawdę wszystko dzieje się bardzo szybko i co najważniejsze, łatwo jest manipulować tym menu. Tworząc dynamicznie różne obiekty lub kontenery obiektów, łatwo zmienić wygląd menu i jego funkcjonalność.","ua":"Ну ось і все, описи багато, але за фактом все відбувається дуже швидко і головне, що легко даним меню маніпулювати. Створюючи динамічно різні об'єкти чи контейнери об'єктів просто змінювати зовнішній вигляд меню та його функціональність.","ru":"Ну вот и всё, описания много, но по факту всё происходит весьма быстро и главное, легко данным меню манипулировать. Создавая динамически разные объекты или контейнеры объектов просто изменять внешний вид меню и его функциональность."},"93":{"en":"Rules for Using the Accordion Module","pl":"Zasady korzystania z Modułu Akordeonowego","ua":"Правила використання модуля Accordion","ru":"Правила использования модуля Accordion"},"94":{"en":"This review looks at how to use Bootstrap's Accordion module in PHP code.","pl":"W tej recenzji przyjrzymy się, jak używać modułu Accordion Bootstrapa w kodzie PHP.","ua":"У цьому огляді розглядається інструкція використання Accordion від Bootstrap, покладеного на PHP код.","ru":"В этом обзоре рассматривается инструкция использования модуля Accordion от Bootstrap, положенного на PHP код."},"95":{"en":"Below is a link to the github, however, this module uses part of the NavBar navigation menu ecosystem, so if this module is used separately from the entire library, then you should copy it along with the NavBar folder.","pl":"Poniżej link do githuba, jednak moduł ten wykorzystuje część ekosystemu menu nawigacji NavBar, więc jeśli ten moduł jest używany oddzielnie od całej biblioteki, to należy go skopiować wraz z folderem NavBar.","ua":"Внизу є посилання на гітхаб, однак цей модуль використовує частково екосистему навігаційного меню NavBar, тому, якщо даний модуль буде використовуватися окремо від усієї бібліотеки, то слід скопіювати його разом з папкою NavBar.","ru":"Внизу есть ссылка на гитхаб, однако, данный модуль использует частично экосистему навигационного меню NavBar, поэтому, если данный модуль будет использоваться отдельно от всей библиотеки, то следует скопировать его вместе с папкой NavBar."},"96":{"en":"The module was created according to the principles of the Composite design pattern, I really liked it. Only Composite is a lightweight option, since there are no complex elements in Accordion, only simple elements remain, which are loaded into the main class, which, in turn, displays the module on the screen.","pl":"Moduł został stworzony zgodnie z zasadami wzorca projektowego Composite, bardzo mi się spodobał. Only Composite to lekka opcja, ponieważ w Accordion nie ma złożonych elementów, pozostają tylko proste elementy, które są ładowane do głównej klasy, która z kolei wyświetla moduł na ekranie.","ua":"Модуль створений за принципами шаблону проектування Composite, дуже він мені сподобався. Тільки Composite полегшений варіант, так як у Accordion відсутні складні елементи, залишилися лише прості елементи, які завантажуються до головного класу, який, у свою чергу, виводить модуль на екран.","ru":"Модуль создан по принципам шаблона проектирования Composite, очень уж он мне понравился. Только Composite облегченный вариант, так как в Accordion отсутствуют сложные элементы, остались только простые элементы, которые загружаются в главный класс, который, в свою очередь, выводит модуль на экран."},"97":{"en":"So let's go!","pl":"Więc chodźmy!","ua":"Тож поїхали!","ru":"Итак, поехали!"},"98":{"en":"The system consists of simple objects that contain information about one item. How many points are needed, so many objects need to be created. After creating these objects, they are placed in the main container, which combines them and displays them on the page.","pl":"System składa się z prostych obiektów zawierających informacje o jednym elemencie. Ile potrzeba punktów, tyle obiektów trzeba stworzyć. Po utworzeniu tych obiektów są one umieszczane w głównym kontenerze, który je łączy i wyświetla na stronie.","ua":"Система складається з простих об'єктів, які містять інформацію про один пункт. Скільки потрібно пунктів, стільки потрібно створити об'єкти. Після створення цих об'єктів вони поміщаються в головний контейнер, який їх об'єднує і виводить на сторінку.","ru":"Система состоит из простых объектов, которые содержат в себе информацию об одном пункте. Сколько нужно пунктов, столько нужно создать объектов. После создания этих объектов – они помещаются в главный контейнер, который их объединяет и выводит на страницу."},"99":{"en":"The markup of the first example from the Bootstrap 5 page was taken as the basis. All style classes are hardcoded in a specific element, if something needs to be changed, then this is changed using the <strong>setProperty()<\/strong> method.","pl":"Za podstawę wzięto znaczniki z pierwszego przykładu ze strony Bootstrap 5. Wszystkie klasy stylów są zakodowane na stałe w określonym elemencie, jeśli trzeba coś zmienić, to jest to zmieniane za pomocą <strong>setProperty()<\/strong> metoda.","ua":"За основу було взято розмітку першого прикладу зі сторінки Bootstrap 5. Всі стильові класи зашиті в конкретному елементі, якщо необхідно щось змінити, то це змінюється за допомогою методу <strong>setProperty()<\/strong>.","ru":"За основу была взята разметка первого примера со страницы Bootstrap 5. Все стилевые классы зашиты в конкретном элементе, если необходимо что-то изменить, то изменяется это с помощью метода <strong>setProperty()<\/strong>."},"100":{"en":"This is a slight difference from the organization of the NavBar ecosystem. If there the properties were stored in the main container and changed by the methods of the main container, then here the system is more flexible, the methods change the properties of the element itself. Therefore, you can change these properties after the creation of the object at any time. In NavBar, all button properties are set before it is created and cannot be changed. ","pl":"Jest to niewielka różnica w stosunku do organizacji ekosystemu NavBar. Jeśli tam właściwości były przechowywane w głównym kontenerze i zmieniane metodami głównego kontenera, to tutaj system jest bardziej elastyczny, metody zmieniają właściwości samego elementu. Dlatego możesz zmienić te właściwości po utworzeniu obiektu w dowolnym momencie. Na pasku nawigacyjnym wszystkie właściwości przycisków są ustawiane przed ich utworzeniem i nie można ich zmienić.","ua":"Це невелика відмінність від організації екосистеми NavBar. Якщо властивості зберігалися в головному контейнері і змінювалися методами головного контейнера, то тут система гнучкіша, методи змінюють властивості самого елемента. Тому змінювати ці властивості можна після створення об'єкта будь-якої миті часу. У NavBar всі властивості кнопки закладаються до її створення, і їх не можна змінити.","ru":"В этом есть небольшое отличие от организации экосистемы NavBar. Если там свойства хранились в главном контейнере и изменялись методами главного контейнера, то здесь система более гибкая, методы меняют свойства самого элемента. Поэтому изменять эти свойства можно после создания объекта в любой момент времени. В NavBar все свойства кнопки закладываются до её создания и их нельзя изменить."},"101":{"en":"<strong>Step one<\/strong>. Create an Accordion point object. ","pl":"<strong>Krok pierwszy<\/strong>. Utwórz obiekt punktu akordeonowego. ","ua":"<strong>Крок перший<\/strong>. Створюємо об'єкт пункту Accordion.","ru":"<strong>Шаг первый<\/strong>. Создаем объект пункта Accordion."},"102":{"en":"If you need to change style classes, then after creating the object, call its <strong>setProperty()<\/strong> method and change according to the scheme from NavBar, two parameters are indicated, the first is the default class, the second is a new class to replace the old one class. In addition to style classes, there are values that must be filled in to create an accordion item - this is the label on the button and the text in the drop-down part. For these purposes, two properties are used: button and messages, respectively.","pl":"Jeśli chcesz zmienić klasy stylów, to po utworzeniu obiektu wywołaj jego metodę <strong>setProperty()<\/strong> i zmień zgodnie ze schematem z NavBar, wskazane są dwa parametry, pierwszy to klasa domyślna, drugi to nowa klasa, która zastąpi starą. Oprócz klas stylów istnieją wartości, które należy wypełnić, aby utworzyć element akordeonowy - jest to etykieta na przycisku i tekst w rozwijanej części. Do tych celów używane są dwie właściwości: odpowiednio przycisk i komunikaty.","ua":"Якщо потрібно змінити стильові класи, то після створення об'єкта викликаємо його метод <strong>setProperty()<\/strong> і змінюються за схемою від NavBar, вказуються два параметри, перший – це клас за замовчуванням, другий – це новий клас, на заміну старому класу. Крім стильових класів є значення, які слід заповнити для створення пункту accordion – це напис на кнопці та текст у частині, що випадає. З цією метою використовуються дві властивості: button і mesages відповідно.","ru":"Если необходимо изменить стилевые классы, то после создания объекта вызываем его метод <strong>setProperty()<\/strong> и меняются по схеме от NavBar, указывается два параметра, первый – это класс по умолчанию, второй – это новый класс, на замену старому классу. Кроме стилевых классов есть значения, которые следует заполнить для создания пункта accordion – это надпись на кнопке и текст в выпадающей части. Для этих целей используются два свойства: button и mesages соответственно."},"103":{"en":"Trial title","pl":"Tytuł próby","ua":"Заголовок пробний","ru":"Заголовок пробный"},"104":{"en":"Trial title text","pl":"Tekst tytułu wersji próbnej","ua":"Текст пробного заголовка","ru":"Текст пробного заголовка"},"105":{"en":"That's all, the point is created, it remains to create the required number of points-objects and load them into the main container.","pl":"To wszystko, punkt jest tworzony, pozostaje utworzyć wymaganą liczbę punktów-obiektów i załadować je do głównego kontenera.","ua":"Ось і все, створений пункт, залишається створити необхідну кількість пунктів-об'єктів і завантажити їх в головний контейнер.","ru":"Вот и всё, пункт создан, остается создать необходимое число пунктов-объектов и загрузить их в главный контейнер. "},"106":{"en":"But back to the main container, it has its own style property that determines the mode of operation of the accordion module - this is the first style in the example, if you need to change it, then this is done using the standard method, but the method is launched from the container, not from a specific element.","pl":"Ale wracając do głównego kontenera, ma on własną właściwość stylu, która określa tryb działania modułu akordeonowego - jest to pierwszy styl w przykładzie, jeśli chcesz go zmienić, odbywa się to standardową metodą, ale metoda jest uruchamiana z kontenera, a nie z konkretnego elementu.","ua":"Але повернемося до головного контейнера, він має свою стильову властивість, яка визначає режим роботи модуля accordion – це перший стиль у прикладі, якщо його потрібно змінити, то робиться це за допомогою стандартного методу, але метод запускається від контейнера, не від конкретного елемента.","ru":"Но вернёмся к главному контейнеру, у него есть своё стилевое свойство, которое определяет режим работы модуля accordion – это первый стиль в примере, если его нужно изменить, то делается это с помощью стандартного метода, но метод запускается от контейнера, не от конкретного элемента."},"107":{"en":"Now it remains to load the previously created item-objects into the container.","pl":"Teraz pozostaje załadować wcześniej utworzone obiekty-przedmioty do kontenera.","ua":"Тепер залишається завантажити створені раніше пункти-об'єкти у контейнер.","ru":"Теперь остается загрузить созданные ранее пункты-объекты в контейнер."},"108":{"en":"Everything is ready, to install the accordion, you need to run the container method:","pl":"Wszystko jest gotowe, aby zainstalować akordeon, musisz uruchomić metodę kontenera:","ua":"Все готово, для встановлення accordion необхідно запустити метод контейнера:","ru":"Всё готово, для установки accordion необходимо запустить метод контейнера:"},"109":{"en":"Finally, let's consider another mode of accordion operation - this is when the opening of a new item does not close the old ones. To start this mode, when creating individual items, you need to set a special flag to false.","pl":"Na koniec rozważmy inny tryb działania akordeonu - to jest wtedy, gdy otwarcie nowej pozycji nie zamyka starych pozycji. Aby uruchomić ten tryb, podczas tworzenia pojedynczych elementów należy ustawić specjalną flagę na wartość false.","ua":"Насамкінець розглянемо ще один режим роботи акордеону – це коли відкриття нового пункту не закриває старі пункти. Щоб запустити цей режим, під час створення окремих пунктів потрібно встановлювати спеціальний прапор у false.","ru":"Напоследок рассмотрим ещё один режим работы аккордеона – это когда открытие нового пункта не закрывает старые пункты. Чтобы запустить этот режим, при создании отдельных пунктов нужно устанавливать специальный флаг в false."},"110":{"en":"That's all. The video will show how fast and easy it is to create an Accordion.","pl":"To wszystko. Film pokaże, jak szybko i łatwo można stworzyć akordeon.","ua":"От і все. У ролику буде показано, наскільки швидко і просто створюється Accordion.","ru":"Вот и всё. В ролике будет показано на сколько быстро и просто создается Accordion."}}